tests/artillery/test.yaml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10  # 10 users per second

  payload:
    path: "users.csv"
    fields:
      - email
      - password
    order: random

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login and order product"
    flow:
      - post:
          url: "/login"
          form:
            CustomerEmail: "{{ email }}"
            CustomerPassword: "{{ password }}"
          capture:
            - headers:
                cookie: "Set-Cookie"
              as: sessionCookie
      - get:
          url: "/api/products"
          headers:
            Cookie: "{{ sessionCookie }}"
      - post:
          url: "/basket/add/1"
          headers:
            Cookie: "{{ sessionCookie }}"
          json:
            quantity: 1
      - post:
          url: "/api/checkout"
          headers:
            Cookie: "{{ sessionCookie }}"
          json:
            payment_method: "card"