tests/artillery/test.yaml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 3
      arrivalRate: 5
      
  payload:
    path: "users.csv"
    fields:
      - email
      - password
    order: random
  defaults:
    headers:
      Content-Type: "application/x-www-form-urlencoded"
  http:
    followRedirects: true
  processor: "./hooks.mjs"

scenarios:
  - name: "Customer login and purchase"
    flow:
      - post:
          url: "/login"
          form:
            CustomerEmail: "{{ email }}"
            CustomerPassword: "{{ password }}"
          afterResponse: "extractLaravelSession"

      - post:
          url: "/basket/add/1"
          headers:
            Cookie: "{{ sessionCookie }}"
          form:
            quantity: 1

      - post:
          url: "/api/checkout"
          headers:
            Cookie: "{{ sessionCookie }}"
            Content-Type: "application/json"
            Accept: "application/json"
          json:
            address: "123 Main St"
            postcode: "12345"
          afterResponse: "checkCheckout"